#+TITLE: Homotopy Finiteness
#+NAME: Homotopy Finiteness
#+AUTHOR: Johann Rosain

** Closure under \Sigma-types
In this section, we generalize the previous result and forget the connectedness assumption. To do so, we do a double induction; on =n=, and then on the number of connected components. Let us start by showing a little lemma for finite types.
#+begin_src ctt
  is-htpy-finite/closed-Sg/Fin : (k : Nat) (B : Fin (suc k) -> U) (is-htpy-finite-Fin : is-htpy-finite one-Nat (Fin (suc k)))
                                 (is-htpy-finite-B : (x : Fin (suc k)) -> is-htpy-finite zero (B x))
                                  -> is-htpy-finite zero (Sg (Fin (suc k)) B) = split
    zero -> \ B is-htpy-finite-Fin is-htpy-finite-B.
      is-htpy-finite/closed-Sg/base
        ( Fin one-Nat) B
        ( Set-trunc/closed-contr
          ( Fin one-Nat)
          ( Fin/fin-one-is-contr))
        ( is-htpy-finite-Fin)
        ( is-htpy-finite-B)
    suc k -> \ B is-htpy-finite-Fin is-htpy-finite-B.
      is-htpy-finite/closed-Equiv
        ( Sg (Fin (suc (suc k))) B)
        ( Coprod (Sg (Fin (suc k)) (\ x. B (inl x))) (B (inr star)))
        ( Equiv/trans
          ( Sg (Fin (suc (suc k))) B)
          ( Coprod (Sg (Fin (suc k)) (\ x. B (inl x))) (Sg Unit (\ s. B (inr s))))
          ( Coprod (Sg (Fin (suc k)) (\ x. B (inl x))) (B (inr star)))
          ( Equiv/Sg-distr-over-coprod
            ( Fin (suc k))
            ( Unit) B)
          ( Coprod/closed-Equiv
            ( Sg (Fin (suc k)) (\ x. B (inl x)))
            ( Sg (Fin (suc k)) (\ x. B (inl x)))
            ( Sg Unit (\ s. B (inr s)))
            ( B (inr star))
            ( Equiv/refl (Sg (Fin (suc k)) (\ x. B (inl x))))
            ( Equiv/Sg-unit (\ x. B (inr x)))))
        ( zero)
        ( is-htpy-finite/closed-Coprod zero
          ( Sg (Fin (suc k)) (\ x. B (inl x)))
          ( B (inr star))
          ( is-htpy-finite/closed-Sg/Fin k
            ( \ x. B (inl x))
            ( is-htpy-finite/Coprod/left 
              ( Fin (suc k)) Unit one-Nat
              ( is-htpy-finite-Fin))
            ( \ x. is-htpy-finite-B (inl x)))
          ( is-htpy-finite-B (inr star)))
#+end_src
This lemma allows us to show the base case of the induction.
#+begin_src ctt
  -- is-htpy-finite/closed-Sg/z (A : U) (B : A -> U) (is-htpy-finite-A : is-htpy-finite one-Nat A)
  --                            (is-htpy-finite-B : (x : A) -> is-htpy-finite zero (B x))
  --                               : (k : Nat) -> (f : (Fin k) -> A) -> (e : Equiv (Fin k) (Set-trunc A)) -> is-htpy-finite zero (Sg A B) = split
  --   zero -> \ f e.
  --     is-htpy-finite/closed-Equiv
  --       ( Sg A B) Empty
  --       ( Equiv/trans
  --           ( Sg A B)
  --           ( Sg (Fin zero) (\ x. B (f x)))
  --           ( Empty)
  --           ( Equiv/sym
  --             ( Sg (Fin zero) (\ x. B (f x)))
  --             ( Sg A B)
  --             ( Sg/equiv-base
  --               ( Fin zero) A B
  --               ( Equiv/sym A Empty
  --                 ( Empty/equiv A
  --                   ( is-empty-Set-trunc/is-empty
  --                     ( Equiv/inv-map Empty (Set-trunc A) e))))))
  --           ( Equiv/Equiv-Sg-empty
  --             (\ x. B (f x))))
  --       ( zero)
  --       ( Empty/is-htpy-finite zero)
  --   suc k -> \ f e.
  --     is-htpy-finite/closed-Equiv'
  --       ( Sg (Fin (suc k)) ( \ x. B (f x)))
  --       ( Sg A B)
  --       ( Sg/equiv-base 
  --         ( Fin (suc k)) A B e)
  --       ( zero)
  --       ( is-htpy-finite/closed-Sg/Fin k
  --         ( \ x. B (f x))
  --         ( is-htpy-finite/closed-Equiv
  --           ( Fin (suc k)) A e one-Nat
  --           ( is-htpy-finite-A))
  --         ( \ x. is-htpy-finite-B (f x)))
#+end_src
And we can conclude the inductive case by remarking that for t, u : \Sigma A B, t = u is equivalent to \Sigma_{p: t.1 = u.1}(tr_B(p, t.2) = u.2).
#+begin_src ctt
  -- is-htpy-finite/closed-Sg' : (n : Nat) (A : U) (B : A -> U) (is-htpy-finite-A : is-htpy-finite (suc n) A)
  --                               (is-htpy-finite-B : (x : A) -> is-htpy-finite n (B x)) -> is-htpy-finite n (Sg A B) = split
  --   zero -> \ A B is-htpy-finite-A is-htpy-finite-B.
  --     rec-Prop-trunc
  --       ( count (Set-trunc A))
  --       ( is-htpy-finite/Prop zero (Sg A B))
  --       ( \ c. is-htpy-finite/closed-Sg/z A B is-htpy-finite-A is-htpy-finite-B c.1 c.2)
  --       ( is-htpy-finite-A.1)
  --   suc n -> \ A B is-htpy-finite-A is-htpy-finite-B.
  --     ( is-htpy-finite/closed-Sg' zero A B 
  --       ( is-htpy-finite/is-htpy-one-finite A (suc n) is-htpy-finite-A)
  --       ( \ x. is-htpy-finite/is-finite-Set-trunc
  --               ( B x)
  --               ( suc n)
  --               ( is-htpy-finite-B x)),
  --         \ t u. is-htpy-finite/closed-Equiv
  --                 ( Path (Sg A B) t u)
  --                 ( SgPathO A B t u)
  --                 ( PathSg/Equiv A B t u) n
  --                 ( is-htpy-finite/closed-Sg' n
  --                   ( Path A t.1 u.1)
  --                   ( \ p. Path (B u.1) (tr A t.1 u.1 p B t.2) u.2)
  --                   ( is-htpy-finite-A.2 t.1 u.1)
  --                   ( \ p. (is-htpy-finite-B u.1).2 (tr A t.1 u.1 p B t.2) u.2)))
#+end_src

#+RESULTS:
: Typecheck has succeeded.

